---
kind: method
id: M:Autodesk.Revit.DB.FamilyThermalProperties.IsValid
source: html/c001ea24-7d93-3caf-56c0-d5d4e97a32b0.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties.IsValid Method

Confirms that the thermal properties are correctly set for assignment to a FamilySymbol.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if the thermal properties are valid, false otherwise.